# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

In [2]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names=pd.read_csv(path+'/DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [6]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [19]:
baby_names=baby_names.drop(['Unnamed: 0','Id'],axis='columns')

### Step 6. Are there more male or female names in the dataset?

In [20]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [21]:
#Namen=baby_names['Name'].unique()
#print(Namen)

names=baby_names.sort_values(['Name'],axis=0)
print(names)

          Name  Year Gender State  Count
693699   Aaban  2013      M    NY      6
695768   Aaban  2014      M    NY      6
897674   Aadan  2008      M    TX      5
120728   Aadan  2008      M    CA      7
138678   Aadan  2014      M    CA      5
...        ...   ...    ...   ...    ...
885288  Zyriah  2014      F    TX      6
867512  Zyriah  2009      F    TX      5
881208  Zyriah  2013      F    TX      7
855869  Zyriah  2006      F    TX      6
244816  Zyriah  2012      F    GA      5

[1016395 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [23]:
Namen=baby_names['Name'].unique()
Namen.shape

(17632,)

### Step 9. What is the name with most occurrences?

In [35]:
values=names['Name'].value_counts()
pos=values==values.max()
values.loc[pos]

Riley    1112
Name: Name, dtype: int64

### Step 10. How many different names have the least occurrences?

In [52]:
pos=values==values.min()
print(pos)
values.loc[pos].value_counts()
print(values.loc[pos])

Riley      False
Avery      False
Jordan     False
Peyton     False
Hayden     False
           ...
Abeer       True
Ruperto     True
Laylene     True
Serra       True
Fateh       True
Name: Name, Length: 17632, dtype: bool
Sarine     1
Yossef     1
Daxx       1
Vignesh    1
Jadasia    1
          ..
Abeer      1
Ruperto    1
Laylene    1
Serra      1
Fateh      1
Name: Name, Length: 3682, dtype: int64

### Step 11. What is the median name occurrence?

In [44]:
occurance=names['Name'].value_counts()
#print(occurance)
occurance.median()

8.0

### Step 12. What is the standard deviation of names?

In [45]:
occurance.std()

122.02996350814088

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [50]:
occurance.describe()

count    17632.000000
mean        57.644907
std        122.029964
min          1.000000
25%          2.000000
50%          8.000000
75%         39.000000
max       1112.000000
Name: Name, dtype: float64

In [51]:
occurance.quantile([0.25,0.5,0.75])

0.25     2.0
0.50     8.0
0.75    39.0
Name: Name, dtype: float64